## :warning: Terraform Plan succeeded(change detected)
work_directory: `terraform/common/sandbox/shared-vpc`
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.shared_vpc.module.firewall_rules.google_compute_firewall.rules["allow-internal"] will be updated in-place
  ~ resource "google_compute_firewall" "rules" {
        id                      = "projects/common-sandbox-shared-vpc/global/firewalls/allow-internal"
        name                    = "allow-internal"
      ~ network                 = "https://www.googleapis.com/compute/v1/projects/common-sandbox-shared-vpc/global/networks/common-sandbox-shared-vpc" -> "common-sandbox-shared-vpc2"
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.shared_vpc.module.firewall_rules.google_compute_firewall.rules["allow-ssh-from-bastion"] will be updated in-place
  ~ resource "google_compute_firewall" "rules" {
        id                      = "projects/common-sandbox-shared-vpc/global/firewalls/allow-ssh-from-bastion"
        name                    = "allow-ssh-from-bastion"
      ~ network                 = "https://www.googleapis.com/compute/v1/projects/common-sandbox-shared-vpc/global/networks/common-sandbox-shared-vpc" -> "common-sandbox-shared-vpc2"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.shared_vpc.module.firewall_rules.google_compute_firewall.rules["allow-ssh-from-iap"] will be updated in-place
  ~ resource "google_compute_firewall" "rules" {
        id                      = "projects/common-sandbox-shared-vpc/global/firewalls/allow-ssh-from-iap"
        name                    = "allow-ssh-from-iap"
      ~ network                 = "https://www.googleapis.com/compute/v1/projects/common-sandbox-shared-vpc/global/networks/common-sandbox-shared-vpc" -> "common-sandbox-shared-vpc2"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.shared_vpc.module.subnets.google_compute_subnetwork.subnetwork["asia-northeast1/sandbox-subnet-01"] must be replaced
-/+ resource "google_compute_subnetwork" "subnetwork" {
      ~ creation_timestamp         = "2023-12-25T00:48:27.063-08:00" -> (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.0.0.1" -> (known after apply)
      ~ id                         = "projects/common-sandbox-shared-vpc/regions/asia-northeast1/subnetworks/sandbox-subnet-01" -> (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ipv6_cidr_range            = (known after apply)
        name                       = "sandbox-subnet-01"
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/common-sandbox-shared-vpc/global/networks/common-sandbox-shared-vpc" -> "common-sandbox-shared-vpc2" # forces replacement
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/common-sandbox-shared-vpc/regions/asia-northeast1/subnetworks/sandbox-subnet-01" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.shared_vpc.module.subnets.google_compute_subnetwork.subnetwork["asia-northeast1/sandbox-subnet-02"] must be replaced
-/+ resource "google_compute_subnetwork" "subnetwork" {
      ~ creation_timestamp         = "2023-12-25T00:48:25.879-08:00" -> (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.0.1.1" -> (known after apply)
      ~ id                         = "projects/common-sandbox-shared-vpc/regions/asia-northeast1/subnetworks/sandbox-subnet-02" -> (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ipv6_cidr_range            = (known after apply)
        name                       = "sandbox-subnet-02"
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/common-sandbox-shared-vpc/global/networks/common-sandbox-shared-vpc" -> "common-sandbox-shared-vpc2" # forces replacement
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/common-sandbox-shared-vpc/regions/asia-northeast1/subnetworks/sandbox-subnet-02" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.shared_vpc.module.vpc.google_compute_network.network must be replaced
-/+ resource "google_compute_network" "network" {
      - enable_ula_internal_ipv6                  = false -> null
      + gateway_ipv4                              = (known after apply)
      ~ id                                        = "projects/common-sandbox-shared-vpc/global/networks/common-sandbox-shared-vpc" -> (known after apply)
      + internal_ipv6_range                       = (known after apply)
      ~ name                                      = "common-sandbox-shared-vpc" -> "common-sandbox-shared-vpc2" # forces replacement
      ~ self_link                                 = "https://www.googleapis.com/compute/v1/projects/common-sandbox-shared-vpc/global/networks/common-sandbox-shared-vpc" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

Changes to Outputs:
  ~ subnets    = [
      - "projects/common-sandbox-shared-vpc/regions/asia-northeast1/subnetworks/sandbox-subnet-01",
      - "projects/common-sandbox-shared-vpc/regions/asia-northeast1/subnetworks/sandbox-subnet-02",
      + (known after apply),
      + (known after apply),
    ]
```
</details>